tap "anomalyco/tap"
tap "homebrew/services", "https://gitee.com/cunkai/homebrew-services.git"
tap "nikitabobko/tap"
tap "r-lib/rig"

brew "age"
brew "atuin"
brew "bat"
brew "btop"
brew "chezmoi"
brew "difftastic"
brew "direnv"
brew "displayplacer"
brew "duckdb"
brew "dust"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fontconfig"
brew "fzf"
brew "gdu"
brew "gh"
brew "git-delta"
brew "glow"
brew "hyperfine"
brew "jless"
brew "jq"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "mise"
brew "mole"
brew "ncdu"
brew "neovim"
brew "ollama"
brew "onefetch"
brew "postgresql@18", link: true
brew "presenterm"
brew "starship"
brew "tailscale"
brew "yazi"
brew "yq"
brew "zellij"
brew "zola"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode", trusted: true

go "github.com/wailsapp/wails/v2/cmd/wails"
cargo "rustlings"
npm "corepack"
