tap "nikitabobko/tap"
tap "r-lib/rig"

cask "nikitabobko/tap/aerospace"
cask "bilibili"
cask "bob-app"
cask "claude-code"
cask "dbeaver-community"
cask "font-0xproto"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple-mono-nf-cn"
cask "font-sarasa-gothic"
cask "ghostty"
cask "homerow"
cask "iina"
cask "iterm2"
cask "jellyfin"
cask "jellyfin-media-player"
cask "linear"
cask "lyricsx"
cask "monitorcontrol"
cask "obsidian"
cask "orbstack"
cask "raycast"
cask "r-lib/rig/rig"
cask "sioyek"
cask "soundflowerbed"
cask "tailscale-app"
cask "visual-studio-code@insiders"

vscode "charliermarsh.ruff"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
