tap "anomalyco/tap"
tap "homebrew/services", "https://gitee.com/cunkai/homebrew-services.git"
tap "nikitabobko/tap"
tap "r-lib/rig"

brew "bat"
brew "btop"
brew "chezmoi"
brew "displayplacer"
brew "duckdb"
brew "dust"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fontconfig"
brew "fzf"
brew "gdu"
brew "git"
brew "glow"
brew "jq"
brew "lazygit"
brew "mise"
brew "mole"
brew "ncdu"
brew "neofetch"
brew "neovim"
brew "node"
brew "starship"
brew "tailscale"
brew "tmux"
brew "uv"
brew "yazi"
brew "yq"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "anomalyco/tap/opencode"
